In [2]:
import pandas as pd
import numpy as np


¿Qué diferencia hay entre una Serie y un DataFrame?

Una Serie es una unica dimensión y correspondería a una columna
Un DataFrame son dos dimesiones, y puede tener multiples columnas

Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [4]:
array_vacio = np.empty((4,3))

In [5]:
array_vacio

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [7]:
df1 = pd.DataFrame(array_vacio, columns=["España", "Francia", "Italia"])
df1

   España  Francia  Italia
0     0.0      0.0     0.0
1     0.0      0.0     0.0
2     0.0      0.0     0.0
3     0.0      0.0     0.0


Descarga el archivo "medallas" y carga el DataFrame.

In [10]:
df_medallas = pd.read_csv("files/medallas.csv", index_col=0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

Usando el loc extrae todas las columnas de la fila de Tailandia.

In [14]:
df_medallas.loc[7,:]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [19]:
df_medallas.loc[7,]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object


Usando el loc extrae todas las columnas de China e Irán

In [15]:
df_medallas.loc[[4, 9],:]

           País  Oro  Plata  Bronce
4          Irán  179    181     197
9  China Taipéi   99    144     276

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [17]:
df_medallas.loc[[1,4],"Oro":"Bronce"]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [18]:
df_medallas.iloc[5,]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object


Usando el iloc extrae todas las columnas de los países que estén en posición(indice) impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [21]:
df_medallas.iloc[1::2, ]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [22]:
df_medallas.iloc[1::2, 1:]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235


Contesta a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [25]:
df_medallas[df_medallas["Oro"]>200]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [26]:
df_medallas[(df_medallas["Oro"]>200) & (df_medallas["Plata"]>1000)]

    País   Oro  Plata  Bronce
2  Japón  1032   1037     985

In [27]:
df_medallas[(df_medallas["Oro"]>200)|(df_medallas["Bronce"]>700)]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827


Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [39]:
np.sum([df_medallas["Oro"], df_medallas["Plata"], df_medallas["Bronce"]], axis=0)

array([3187, 3054, 2235,  557,  537,  671,  585,  483,  519,  446])

In [40]:
#complicandonos la vida
df_medallas["Total"] = np.sum([df_medallas["Oro"], df_medallas["Plata"], df_medallas["Bronce"]], axis=0)

In [41]:
df_medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446

In [53]:
#una complicación más
df_medallas["Total2"] = df_medallas[["Oro", "Plata", "Bronce"]].sum(axis=1)

In [54]:
df_medallas

               País   Oro  Plata  Bronce  Total  Total2
1             China  1473    994     720   3187    3187
2             Japón  1032   1037     985   3054    3054
3     Corea del Sur   745    663     827   2235    2235
4              Irán   179    181     197    557     557
5        Kazajistán   155    158     224    537     537
6             India   154    202     315    671     671
7         Tailandia   132    175     278    585     585
8         Indonesia   112    131     240    483     483
9      China Taipéi    99    144     276    519     519
10  Corea del Norte    91    120     235    446     446

Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [55]:
import random

In [62]:
valores = random.sample(range(1,51),7)
valores

[14, 2, 48, 20, 26, 11, 4]

In [63]:
import calendar

In [65]:
indices = list(calendar.day_name)
indices

['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']


A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [67]:
semana = pd.Series(valores, index=indices)
semana

Monday       14
Tuesday       2
Wednesday    48
Thursday     20
Friday       26
Saturday     11
Sunday        4
dtype: int64


A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más información sobre este método aquí.

In [73]:
list(zip(indices, valores))

[('Monday', 14),
 ('Tuesday', 2),
 ('Wednesday', 48),
 ('Thursday', 20),
 ('Friday', 26),
 ('Saturday', 11),
 ('Sunday', 4)]

In [75]:
dicc_semana = {}

for k,v in zip(indices, valores):
    dicc_semana[k] = v

In [76]:
dicc_semana

{'Monday': 14,
 'Tuesday': 2,
 'Wednesday': 48,
 'Thursday': 20,
 'Friday': 26,
 'Saturday': 11,
 'Sunday': 4}


Crea una Serie con el diccionario creado en el punto anterior.

In [77]:
pd.Series(dicc_semana)

Monday       14
Tuesday       2
Wednesday    48
Thursday     20
Friday       26
Saturday     11
Sunday        4
dtype: int64

In [78]:
dicc_semana.shape

AttributeError: 'dict' object has no attribute 'shape'